"x"
"half_hearted"
"give_4"
"scriptwriters"
"this_dull"
"bad_at_all"
"dorm"
"liked_movie"
"blew_away"
"isn't_for"
"stopped_watching"
"but_not_much"
"grade_b"
"negative_comments"
"not_disappointed"
"back_enjoy"
"every_time_watch"
"forward_to_this"
"not_in_good"
"this_travesty"
"wanting_more"
"country's"
"lost_interest"
"distasteful"
"looks_as_if"
"so_disappointed"
"bad_reviews"
"just_enjoy"
"little_else"
"little_slow"
"mcdowell"
"only_reason_to"
"might_enjoy"
"revolting"
"reason_to_watch_this"
"entertains"
"spinal_tap"
"total_lack"
"blown_up"
"7.5"
"only_complaint"
"still_this"
"1_2_from"
"potential_but"
"this_fun"
"email"
"if_must"
"marvellous"
"even_close_to"
"hairy"
"vapid"
"not_typical"
"unappealing"
"on_plus_side"
"dvd_cover"
"something_better"
"fine_film"
"lot_of_things"
"only_saving"
"or_hate"
"than_many"
"what_point_of"
"in_grave"
"get_copy"
"penalty"
"this_very_good"
"grade_d"
"stereotyped"
"or_dvd"
"very_moving"
"about_time"
"deliciously"
"anyone_interested"
"had_high"
"motions"
"letdown"
"moves_along"
"plodding"
"excellently"
"won't_be_disappointed"
"glad_did"
"must_for"
"who_made_this"
"how_not_to"
"cerebral"
"flimsy"
"for_actors"
"than_expected"
"there_some_good"
"what_exactly"
"absorbing"
"do_not_watch_this"
"walking_around"
"definitely_recommend"
"embarrassingly"
"bela_lugosi"
"little_movie"
"predictable_but"
"few_laughs"
"wider"
"maybe_if"
"steals_show"
"detract"
"ladder"
"this_fine"
"wouldn't_recommend"
"neatly"
"not_recommended"
"turd"
"film_school"
"wanted_to_like"
"how_not"
"very_disappointing"
"watch_over"
"able_to_see"
"if_director"
"very_slow"
"lot_about"
"one_star"
"tolerable"
"fortunate"
"glued"
"looks_at"
"but_sadly"
"energetic"
"just_wasn't"
"be_comedy"
"fell_asleep"
"mystery_science"
"dirty_harry"
"below_average"
"favorite_movies"
"paramount"
"surprisingly_good"
"if_don't_like"
"simply_not"
"wrenching"
"thumbs_up"
"just_great"
"only_problem"
"voodoo"
"would_be_good"
"hoot"
"lifeless"
"main_problem"
"9_out_of_10"
"put_off"
"this_turkey"
"hackneyed"
"inaccurate"
"unlikeable"
"more_movies"
"joy_to"
"yawn"
"can_relate"
"what_thinking"
"bothered_to"
"jackass"
"olds"
"polished"
"see_any"
"from_outer_space"
"be_missed"
"check_this"
"save_money"
"restored"
"what_point"
"complaints"
"muddled"
"2_out_of_10"
"simplicity"
"bravo"
"christians"
"i'm_afraid"
"3_out_of_10"
"in_lives"
"cash_in"
"doesn't_help"
"not_enough_to"
"very_enjoyable"
"isn't_very"
"spot_on"
"few_good"
"started_out"
"8_out_of"
"tiresome"
"sit_back"
"sub_par"
"for_once"
"8_out"
"just_seems"
"story_told"
"look_forward"
"not_very_good"
"any_of_characters"
"baldwin"
"4_out_of_10"
"based_on_true_story"
"every_day"
"been_great"
"don't_miss"
"tripe"
"embarrassment"
"inappropriate"
"cleverly"
"7_out_of"
"stilted"
"stock_footage"
"understated"
"very_disappointed"
"7_out"
"careful"
"for_free"
"riveting"
"bad_thing"
"just_isn't"
"disappoint"
"downhill"
"rip_off_of"
"little_film"
"shelf"
"can't_wait"
"pleasantly_surprised"
"just_right"
"should_never"
"splendid"
"minutes_into"
"not_recommend"
"on_edge_of"
"to_see_again"
"unintentional"
"1_out"
"this_excellent"
"skip_this"
"too_seriously"
"fast_paced"
"ideal"
"walked_out"
"interesting_but"
"should_see"
"stinker"
"lot_of_fun"
"unwatchable"
"draws"
"first_rate"
"of_funniest"
"how_good"
"disjointed"
"drivel"
"from_original"
"highly_recommend_this"
"save_this"
"worthless"
"of_seat"
"10_out_of_10"
"sadistic"
"would_love_to"
"one_of_better"
"flawless"
"fears"
"insulting"
"pleased"
"that's_about"
"definite"
"first_saw_this"
"incoherent"
"superbly"
"this_mess"
"cried"
"2_10"
"10_out"
"holly"
"brazil"
"tries_to_be"
"isn't_even"
"too_hard"
"eerie"
"to_recommend"
"unintentionally"
"appalling"
"this_short"
"even_that"
"trite"
"without_being"
"definitely_worth"
"hype"
"insult_to"
"miscast"
"cardboard"
"identify"
"elsewhere"
"guilt"
"very_entertaining"
"annoyed"
"uninspired"
"bible"
"doesn't_work"
"lacked"
"can_watch"
"stick_to"
"hooked"
"unforgettable"
"this_best"
"bugs"
"troubled"
"consequences"
"fast_forward"
"boredom"
"perfection"
"wasting"
"even_better"
"marvelous"
"2_out"
"courage"
"see_again"
"power_of"
"this_crap"
"mst3k"
"existent"
"embarrassed"
"best_part"
"exceptional"
"idiotic"
"absolutely_nothing"
"gripping"
"looking_forward"
"sinatra"
"ashamed"
"not_one_of"
"credibility"
"again_again"
"fabulous"
"let_down"
"chilling"
"carries"
"packed"
"1_10"
"obnoxious"
"3_10"
"much_better_than"
"stupidity"
"performances_by"
"thought_provoking"
"raw"
"screenwriter"
"inept"
"ludicrous"
"not_make"
"to_work_with"
"9_10"
"succeeds"
"great_but"
"stay_away"
"uninteresting"
"unconvincing"
"paint"
"loved_this"
"bore"
"top_notch"
"nonetheless"
"would've"
"atrocious"
"sensitive"
"mildly"
"rest_of_movie"
"remotely"
"than_any"
"no_other"
"alright"
"be_disappointed"
"only_good"
"4_10"
"if_want_to_see"
"urban"
"appreciated"
"gritty"
"junk"
"refreshing"
"would_recommend"
"forgettable"
"touches"
"just_doesn't"
"like_watching"
"favorites"
"mainstream"
"seagal"
"just_too"
"extraordinary"
"liked_this"
"enjoyed_this"
"may_not_be"
"offensive"
"highly_recommended"
"captures"
"for_everyone"
"satisfying"
"reason_for"
"turkey"
"promising"
"this_thing"
"asleep"
"just_didn't"
"haunting"
"doesn't_make"
"recommend_to"
"ruined"
"7_10"
"whole_film"
"amateurish"
"might_been"
"warm"
"insult"
"propaganda"
"pleasant"
"beginning_to"
"subtitles"
"doesn't_even"
"deals_with"
"research"
"in_black"
"walked"
"to_believe_that"
"to_sit_through"
"very_bad"
"horribly"
"lousy"
"8_10"
"avoid_this"
"steals"
"embarrassing"
"tedious"
"surreal"
"well_written"
"nevertheless"
"little_to"
"work_in"
"two_hours"
"traditional"
"be_funny"
"great_job"
"this_piece_of"
"ages"
"not_worth"
"underrated"
"rip_off"
"endless"
"brilliantly"
"delightful"
"through_this"
"those_of"
"first_saw"
"pretentious"
"shallow"
"unexpected"
"most_people"
"freedom"
"identity"
"ultimate"
"just_not"
"unrealistic"
"dreadful"
"irritating"
"not_funny"
"spectacular"
"screaming"
"unfunny"
"well_worth"
"far_too"
"sucked"
"dimensional"
"worth_seeing"
"absolutely_no"
"attempt_at"
"felt_like"
"of_fun"
"frankly"
"quiet"
"this_piece"
"finest"
"crappy"
"10_10"
"bland"
"so_well"
"why_did"
"witty"
"rubbish"
"saving"
"not_enough"
"not_good"
"magnificent"
"make_movie"
"highly_recommend"
"lacking"
"shots_of"
"absurd"
"come_on"
"of_war"
"for_first_time"
"nonsense"
"about_as"
"vhs"
"remarkable"
"below"
"friendship"
"only_reason"
"don't_want"
"unusual"
"treat"
"brutal"
"no_sense"
"nicely"
"sit_through"
"wonderfully"
"read_book"
"don't_even"
"some_kind_of"
"surprising"
"be_good"
"redeeming"
"tears"
"animal"
"b_movie"
"watchable"
"what_makes"
"favourite"
"sucks"
"apartment"
"pleasure"
"moved"
"wooden"
"way_too"
"scientist"
"thin"
"this_great"
"whatsoever"
"just_plain"
"tragic"
"good_film"
"provides"
"impact"
"start_to"
"disaster"
"rented"
"mediocre"
"as_good_as"
"intense"
"as_much_as"
"gorgeous"
"christian"
"delivers"
"ugly"
"adds"
"funniest"
"helps"
"not_very"
"victims"
"paid"
"worst_movie"
"information"
"impressed"
"lacks"
"gem"
"not_much"
"supposedly"
"very_little"
"cliché"
"made_this"
"very_funny"
"compelling"
"noir"
"jean"
"confusing"
"dreams"
"fresh"
"really_good"
"performance_as"
"world_of"
"fascinating"
"tired"
"stunning"
"disappointment"
"not_one"
"love_this"
"this_just"
"outstanding"
"hoping"
"or_something"
"excuse"
"bond"
"should_been"
"painful"
"if_had"
"unbelievable"
"great_movie"
"touching"
"thank"
"rare"
"suppose"
"pass"
"emotions"
"laughable"
"disappointing"
"knowing"
"terrific"
"bad_movie"
"innocent"
"may_not"
"at_best"
"charming"
"comedies"
"ride"
"frank"
"catch"
"complex"
"available"
"to_all"
"subtle"
"beautifully"
"nowhere"
"must_see"
"edge"
"bother"
"glad"
"journey"
"surprisingly"
"twists"
"grade"
"honestly"
"thanks"
"failed"
"to_help"
"much_as"
"one_of_worst"
"accent"
"genius"
"if_want_to"
"80_s"
"solid"
"garbage"
"barely"
"well_done"
"if_this"
"effective"
"awesome"
"trash"
"pathetic"
"pointless"
"recommended"
"only_thing"
"too_many"
"producers"
"appreciate"
"portrayal"
"follows"
"neither"
"bored"
"than_this"
"value"
"not_that"
"movie_just"
"plenty_of"
"sweet"
"sadly"
"van"
"incredible"
"to_believe"
"at_same"
"flat"
"pretty_good"
"potential"
"filmmakers"
"in_way"
"unlike"
"match"
"caught"
"for_those"
"back_in"
"at_first"
"deserves"
"fails"
"good_as"
"wasted"
"present"
"just_as"
"brings"
"look_like"
"of_worst"
"plenty"
"joke"
"believe_that"
"powerful"
"dumb"
"unique"
"mess"
"minutes_of"
"writers"
"but_still"
"keeps"
"recommend_this"
"badly"
"perfectly"
"none_of"
"masterpiece"
"superb"
"beauty"
"meets"
"society"
"otherwise"
"it's_just"
"memorable"
"write"
"unless"
"season"
"bunch_of"
"shame"
"lame"
"poorly"
"at_time"
"first_time"
"premise"
"atmosphere"
"9"
"weak"
"if_want"
"material"
"believable"
"so_bad"
"much_better"
"rent"
"film_in"
"8"
"greatest"
"oscar"
"avoid"
"fantastic"
"realistic"
"okay"
"7"
"tale"
"looks_like"
"on_dvd"
"effort"
"ways"
"sorry"
"tried"
"easy"
"surprised"
"dull"
"release"
"any_of"
"very_well"
"enjoyable"
"appears"
"all_in"
"future"
"would_been"
"predictable"
"comic"
"tells"
"moving"
"not_even"
"of_what"
"at_times"
"episodes"
"lack_of"
"jack"
"one_of_best"
"cheap"
"basically"
"attention"
"could_been"
"apparently"
"disappointed"
"silly"
"saw_this"
"ridiculous"
"light"
"relationship"
"annoying"
"as_if"
"watching_this"
"today"
"even_though"
"reality"
"attempt"
"that_would"
"obvious"
"crap"
"simple"
"story_of"
"looked"
"wouldn't"
"save"
"wonder"
"ok"
"hilarious"
"chance"
"lack"
"strong"
"better_than"
"experience"
"except"
"of_best"
"highly"
"decent"
"of_most"
"did_not"
"city"
"sometimes"
"very_good"
"hour"
"favorite"
"brilliant"
"enjoyed"
"at_end"
"works"
"able_to"
"amazing"
"horrible"
"writing"
"heart"
"fine"
"4"
"unfortunately"
"with_this"
"guess"
"lives"
"seemed"
"waste"
"problem"
"supposed"
"loved"
"entertaining"
"worse"
"liked"
"oh"
"couldn't"
"gives"
"definitely"
"often"
"perfect"
"episode"
"others"
"small"
"human"
"wonderful"
"keep"
"mean"
"terrible"
"for_this"
"women"
"recommend"
"awful"
"truly"
"performances"
"stupid"
"but_this"
"classic"
"low"
"wrong"
"camera"
"enjoy"
"boring"
"3"
"either"
"completely"
"poor"
"nice"
"1"
"death"
"at_all"
"idea"
"excellent"
"left"
"beautiful"
"takes"
"later"
"half"
"instead"
"of_course"
"someone"
"war"
"together"
"job"
"wasn't"
"money"
"true"
"looks"
"reason"
"different"
"shows"
"book"
"maybe"
"dvd"
"trying"
"especially"
"although"
"looking"
"played"
"day"
"each"
"worst"
"fun"
"of_movie"
"performance"
"2"
"last"
"family"
"anything"
"feel"
"minutes"
"script"
"bit"
"least"
"interesting"
"original"
"always"
"saw"
"times"
"music"
"to_make"
"series"
"may"
"own"
"both"
"seems"
"world"
"quite"
"again"
"lot"
"new"
"find"
"director"
"makes"
"nothing"
"didn't"
"years"
"actors"
"thing"
"watching"
"should"
"why"
"still"
"better"
"off"
"best"
"life"
"acting"
"plot"
"love"
"seen"
"many"
"think"
"any"
"could"
"one_of"
"don't"
"most"
"also"
"will"
"great"
"bad"
"well"
"can"
"see"
"only"
"to_be"
"would"
"even"
"time"
"no"
"very"
"more"
"good"
"it's"
"just"
"who"
